# Brewfile — reproducible macOS dev environment
# Run: brew bundle --file=Brewfile

# ── Taps ──
tap "mesa-dot-dev/tap"
tap "withgraphite/tap"
tap "stripe/stripe-cli"
tap "tiimie1/tap"

# ── CLI tools ──
brew "awscli"
brew "fzf"
brew "gh"
brew "go"
brew "htop"
brew "jq"
brew "neovim"
brew "node"
brew "nvm"
brew "pipx"
brew "rust"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"

# Dev tools
brew "act"
brew "go-task"
brew "golangci-lint"
brew "grpcurl"
brew "helm"
brew "k3d"
brew "k9s"
brew "kubectx"
brew "protobuf"
brew "terraform"

# Database
brew "postgresql@15"
brew "pgvector"
brew "pgsync"
brew "redis"

# Graphite + Mesa
brew "withgraphite/tap/graphite"
brew "mesa-dot-dev/tap/code-review"
brew "tiimie1/tap/claude-bell"
brew "stripe/stripe-cli/stripe"

# ── GUI apps (casks) ──
cask "claude-code"
cask "docker-desktop"
cask "ghostty"
cask "ngrok"
cask "orbstack"
cask "pgadmin4"
cask "raycast"
cask "visual-studio-code"
cask "warp"
